[{"author": "MockDeath", "title": "Help us fight for net neutrality!", "score": 83383, "id": "7etmk7", "url": "https://www.reddit.com/r/askscience/comments/7etmk7/help_us_fight_for_net_neutrality/", "comms_num": 1180, "timestamp": "2017-11-23T03:38:53+00:00", "body": "The ability to browse the internet is at risk. The FCC preparing to remove net neutrality. This will allow internet service providers to change how they allow access to websites. AskScience and every other site on the internet is put in risk if net neutrality is removed. Help us fight!\n\n\nhttps://www.battleforthenet.com/", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "AskScienceModerator", "title": "Stephen Hawking megathread", "score": 65832, "id": "84auzr", "url": "https://www.reddit.com/r/askscience/comments/84auzr/stephen_hawking_megathread/", "comms_num": 1652, "timestamp": "2018-03-14T13:03:48+00:00", "body": "We were sad to learn that noted physicist, cosmologist, and author [Stephen Hawking](http://www.hawking.org.uk/) has passed away. In the spirit of AskScience, we will try to answer questions about Stephen Hawking's work and life, so feel free to ask your questions below.\n\nLinks:\n\n* [BBC](http://www.bbc.com/news/uk-43396008)\n* [NY Times](https://www.nytimes.com/2018/03/14/obituaries/stephen-hawking-dead.html)\n* [Stephen Hawking Foundation](http://www.stephenhawkingfoundation.org/)\n* [ALS Association](http://www.alsa.org/)\n* [Current Einstein megathread](/r/askscience/comments/84auuc/einstein_birthday_megathread/) for more discussion on general relativity/cosmology.\n\nEDIT: Physical Review Journals has made all 55 publications of his in two of their journals free. You can take a look and read them [here](https://journals.aps.org/collections/stephen-hawking).", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "AskScienceModerator", "title": "Black Lives Matter", "score": 51930, "id": "gvc7k9", "url": "https://www.reddit.com/r/askscience/comments/gvc7k9/black_lives_matter/", "comms_num": 2916, "timestamp": "2020-06-03T01:57:46+00:00", "body": "**Black lives matter.** The moderation team at AskScience wants to express our outrage and sadness at the systemic racism and disproportionate violence experienced by the black community. This has gone on for too long, and it's time for lasting change. \n\nWhen 1 out of every 1,000 black men and boys in the United States can expect to be killed by the police, police violence is a public health crisis. Black men are about 2.5 times more likely to be killed by police than white men. In 2019, 1,099 people were killed by police in the US; 24% of those were black, even though only 13% of the population is black.\n\nWhen black Americans make up a disproportionate number of COVID-19 deaths, healthcare disparity is another public health crisis. In Michigan, black people make up 14% of the population and 40% of COVID-19 deaths. In Louisiana, black people are 33% of the population but account for 70% of COVID-19 deaths. Black Americans are more likely to work in essential jobs, with 38% of black workers employed in these industries compared with 29% of white workers. They are less likely to have access to health insurance and more likely to lack continuity in medical care.\n\nThese disparities, these crises, are not coincidental. They are the result of systemic racism, economic inequality, and oppression. \n\nChange requires us to look inward, too. For over a decade, AskScience has been a forum where redditors can discuss scientific topics with scientists. Our panel includes hundreds of STEM professionals who volunteer their time, and we are proud to be an interface between scientists and non-scientists. We are fully committed to making science more accessible, and we hope it inspires people to consider careers in STEM. \n\nHowever, we must acknowledge that STEM suffers from a marked lack of diversity. In the US, black workers comprise 11% of the US workforce, but hold just 7% of STEM jobs that require a bachelor’s degree or higher. Only 4% of medical doctors are black. Hispanic workers make up 16% of the US workforce, 6% of STEM jobs that require a bachelor’s degree or higher, and 4.4% of medical doctors. Women make up 47% of the US workforce but 41% of STEM professionals with professional or doctoral degrees. And while we know around 3.5% of the US workforce identifies as LGBTQ+, their representation in STEM fields is largely unknown.\n\nThese numbers become even more dismal in certain disciplines. For example, as of 2019, less than 4% of tenured or tenure-track geoscience positions are held by people of color, and fewer than 100 black women in the US have received PhDs in physics.\n\nThis lack of diversity is unacceptable and actively harmful, both to people who are not afforded opportunities they deserve and to the STEM community as a whole. We cannot truly say we have cultivated the best and brightest in our respective fields when we are missing the voices of talented, brilliant people who are held back by widespread racism, sexism, and homophobia.\n\nIt is up to us to confront these systemic injustices directly. We must all stand together against police violence, racism, and economic, social, and environmental inequality. STEM professional need to make sure underrepresented voices are heard, to listen, and to offer support. We must be the change. \n\n-----\n\n**Sources:**\n\n- https://www.pnas.org/content/116/34/16793\n- https://mappingpoliceviolence.org/\n- https://labblog.uofmhealth.org/rounds/racial-disparities-time-of-covid-19\n- https://www.ncbi.nlm.nih.gov/books/NBK24693/\n- https://www.joincampaignzero.org/research\n- https://www.theguardian.com/commentisfree/2020/apr/16/black-workers-coronavirus-covid-19\n- https://www.npr.org/transcripts/867466515\n- https://www.pewsocialtrends.org/2018/01/09/diversity-in-the-stem-workforce-varies-widely-across-jobs/\n- https://www.nature.com/articles/s41561-019-0519-z\n- https://physicstoday.scitation.org/do/10.1063/PT.6.3.20190529a/full/\n- https://www.washingtonpost.com/outlook/2018/09/11/even-progressive-academics-can-be-racist-ive-experienced-it-firsthand/\n- http://www.bu.edu/articles/2017/lgbt-issues-stem-diversity/", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "MockDeath", "title": "A message to our users", "score": 39292, "id": "3by2nk", "url": "https://www.reddit.com/r/askscience/comments/3by2nk/a_message_to_our_users/", "comms_num": 1189, "timestamp": "2015-07-03T10:43:47+00:00", "body": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Today in AskScience we wish to spotlight our solidarity with the subreddits that have closed today, whose operations depend critically on timely communication and input from the admins.  This post is motivated by the events of today coupled with previous interactions AskScience moderators have had in the past with the reddit staff.\n\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;This is an issue that has been chronically inadequate for moderators of large subreddits reaching out to the admins over the years. Reddit is a great site with an even more amazing community, however it is frustrating to volunteer time to run a large subreddit and have questions go unacknowledged by the people running the site.\n\n&nbsp;&nbsp;&nbsp;&nbsp;We have not gone private because our team has chosen to keep the subreddit open for our readers, but instead stating our disapproval of how events have been handled currently as well as the past.", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "This31415926535", "title": "Why is it that during winter it's not uncommon to have days with abnormally high temperature and summer-like weather, but in the summer it never drops to winter-like weather for a day?", "score": 37667, "id": "7yx524", "url": "https://www.reddit.com/r/askscience/comments/7yx524/why_is_it_that_during_winter_its_not_uncommon_to/", "comms_num": 967, "timestamp": "2018-02-21T00:23:37+00:00", "body": "I live in the USA Midwest", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "GPL89", "title": "If we could travel at 99.9% the speed of light, it would take 4 years to get to Alpha Centauri. Would the people on the spaceship feel like they were stuck on board for 4 years or would it feel shorter for them?", "score": 34355, "id": "ahyapf", "url": "https://www.reddit.com/r/askscience/comments/ahyapf/if_we_could_travel_at_999_the_speed_of_light_it/", "comms_num": 3066, "timestamp": "2019-01-20T22:57:37+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "infernograve", "title": "Do giraffes get struck by lightning more often than other animals?", "score": 32565, "id": "627akk", "url": "https://www.reddit.com/r/askscience/comments/627akk/do_giraffes_get_struck_by_lightning_more_often/", "comms_num": 929, "timestamp": "2017-03-29T23:25:25+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "Standby4Rant", "title": "What % of my weight am I actually lifting when doing a push-up?", "score": 32345, "id": "78xinz", "url": "https://www.reddit.com/r/askscience/comments/78xinz/what_of_my_weight_am_i_actually_lifting_when/", "comms_num": 1604, "timestamp": "2017-10-27T02:25:46+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "EthanNewb", "title": "What is the point of using screws with a Phillips head, flathead, allen, hex, etc. instead of just having one universal screw type?", "score": 31423, "id": "6dpog2", "url": "https://www.reddit.com/r/askscience/comments/6dpog2/what_is_the_point_of_using_screws_with_a_phillips/", "comms_num": 1648, "timestamp": "2017-05-28T03:59:49+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "ClF3FTW", "title": "If hand sanitizer kills 99.99% of germs, then won't the surviving 0.01% make hand sanitizer resistant strains?", "score": 28886, "id": "75p8dn", "url": "https://www.reddit.com/r/askscience/comments/75p8dn/if_hand_sanitizer_kills_9999_of_germs_then_wont/", "comms_num": 2517, "timestamp": "2017-10-11T22:00:21+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "goodyboomboom", "title": "Do heavily forested regions of the world like the eastern United States experience a noticeable difference in oxygen levels/air quality during the winter months when the trees lose all of their leaves?", "score": 28434, "id": "7xvk9r", "url": "https://www.reddit.com/r/askscience/comments/7xvk9r/do_heavily_forested_regions_of_the_world_like_the/", "comms_num": 953, "timestamp": "2018-02-16T10:11:00+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "Lusiggy", "title": "Does the size of a creature, or the size of its eye, affect what can be seen by the \"naked eye\"? for example, can ants see things we consider microscopic? are ants microscopic to elephants?", "score": 27482, "id": "6idvam", "url": "https://www.reddit.com/r/askscience/comments/6idvam/does_the_size_of_a_creature_or_the_size_of_its/", "comms_num": 617, "timestamp": "2017-06-20T21:00:52+00:00", "body": "Edit: wow. I was expecting something along the lines of \"of course not idiot\"  but this is now my top ever post. Great discussion everyone!\n\nalso yes ants don't have eyes i know that now. i just meant something small that does have eyes.\n\nEdit 2: ok ants DO have eyes.\n\nalso why am i on the front page for asking if elephants can see ants? this is the best day ever!\n\nFINAL EDIT: somebody gave me gold, and this has become the third top post ever on askscience... that is not how i was expecting this to go. thank you all!", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "None", "title": "Can my 7 year old ask you about tornadoes?", "score": 27355, "id": "gfaczm", "url": "https://www.reddit.com/r/askscience/comments/gfaczm/can_my_7_year_old_ask_you_about_tornadoes/", "comms_num": 647, "timestamp": "2020-05-08T00:57:23+00:00", "body": "So my son has high functioning autism and he is obsessed with tornados. He is 7 and constantly pesters his mom and myself with questions. I know the basics but I am hoping that the more knowledgeable of you can provide more correct answers that I can simplify for him. And any other super cool facts wold be super appreciated!\n\nTornados:\n\n1. How do tornadoes create a vortex?\n1. How are their winds so strong?\n1. How do tornadoes form their eye?\n1. Is the center of the tornado the strongest part?\n1. How do tornadoes crush items that it sucks up?", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "SixthGrader", "title": "Why do we have to \"fall\" asleep? Why can't we just decide to be asleep?", "score": 27083, "id": "8zlzuy", "url": "https://www.reddit.com/r/askscience/comments/8zlzuy/why_do_we_have_to_fall_asleep_why_cant_we_just/", "comms_num": 918, "timestamp": "2018-07-17T23:17:27+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "AskScienceModerator", "title": "Have a question about the 2019 novel coronavirus (2019-nCoV)? Ask us here!", "score": 26583, "id": "ewwmem", "url": "https://www.reddit.com/r/askscience/comments/ewwmem/have_a_question_about_the_2019_novel_coronavirus/", "comms_num": 10892, "timestamp": "2020-02-01T07:00:20+00:00", "body": "On Thursday, January 30, 2020, the World Health Organization declared that the new coronavirus epidemic now constitutes a public health emergency of international concern. A majority of cases are affecting people in Hubei Province, China, but additional cases have been reported in at least two dozen other countries. This new coronavirus is currently called the “2019 novel coronavirus” or “2019-nCoV”.\n\nThe moderators of /r/AskScience have assembled a [list of Frequently Asked Questions](https://www.reddit.com/r/askscience/wiki/medicine/2019-ncov), including:\n\n- How does 2019-nCoV spread?\n- What are the symptoms?\n- What are known risk and prevention factors?\n- How effective are masks at preventing the spread of 2019-nCoV?\n- What treatment exists?\n- What role might pets and other animals play in the outbreak?\n- What can I do to help prevent the spread of 2019-nCoV if I am sick?\n- What sort of misinformation is being spread about 2019-nCoV?\n\nOur experts will be on hand to answer your questions below! We also have an earlier [megathread](https://old.reddit.com/r/askscience/comments/etkdx1/coronavirus_megathread/) with additional information.\n\n---\n\n**Note:** We cannot give medical advice. All requests for or offerings of personal medical advice will be removed, as they're against the /r/AskScience rules. For more information, please see [this post](https://www.reddit.com/r/askscience/comments/s4chc/meta_medical_advice_on_askscience_the_guidelines/).", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "StarlordDrT", "title": "For humans, sea water is not drinkable due to its high salt content. How do whales, manatees, seals, and other sea faring mammals stay hydrated?", "score": 26409, "id": "7nuedz", "url": "https://www.reddit.com/r/askscience/comments/7nuedz/for_humans_sea_water_is_not_drinkable_due_to_its/", "comms_num": 1216, "timestamp": "2018-01-03T20:42:02+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "simrc86", "title": "Why do nearsighted people need a prescription and a $300 pair of glasses, while farsighted people can buy their glasses at the dollar store?", "score": 26346, "id": "d26nwr", "url": "https://www.reddit.com/r/askscience/comments/d26nwr/why_do_nearsighted_people_need_a_prescription_and/", "comms_num": 1248, "timestamp": "2019-09-10T20:12:07+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "Onigiri22", "title": "Asked my chemistry teacher (first year of highschool) this \"Why do we use the mole (unit) instead of just using the mass (grams) isn't it easier to handle given the fact that we can weigh it easily? why the need to use the mole?\" And he said he \"doesn't answer to stupid questions\"", "score": 24093, "id": "ahmf5h", "url": "https://www.reddit.com/r/askscience/comments/ahmf5h/asked_my_chemistry_teacher_first_year_of/", "comms_num": 448, "timestamp": "2019-01-19T22:17:33+00:00", "body": "Did I ask a stupid question?\n\nEdit: wow, didn't expect this to blow up like this, ty all for your explanations, this is much clearer now. I didn't get why we would use a unit that describes a quantity when we already have a quantity related unit that is the mass, especially when we know how to weight things. Thank you again for your help, I really didn't expect the reddit community to be so supportive.", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "parquet7", "title": "If we return to the moon, is there a telescope on earth today strong enough to watch astronauts walking around on the surface?", "score": 23644, "id": "d7qi0y", "url": "https://www.reddit.com/r/askscience/comments/d7qi0y/if_we_return_to_the_moon_is_there_a_telescope_on/", "comms_num": 1170, "timestamp": "2019-09-22T21:36:18+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}, {"author": "redditUserError404", "title": "If climate change is a serious threat and sea levels are going to rise or are rising, why don’t we see real-estate prices drastically decreasing around coastal areas?", "score": 22765, "id": "dlh4kv", "url": "https://www.reddit.com/r/askscience/comments/dlh4kv/if_climate_change_is_a_serious_threat_and_sea/", "comms_num": 1851, "timestamp": "2019-10-22T20:20:59+00:00", "body": "", "subscribers": 20559106, "subreddit": "askscience"}]