[{"author": "PresidentObama", "title": "I am Barack Obama, President of the United States -- AMA", "score": 216153, "id": "z1c9z", "url": "https://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/", "comms_num": 23007, "timestamp": "2012-08-30T04:01:36+00:00", "body": "Hi, I’m Barack Obama, President of the United States. Ask me anything. I’ll be taking your questions for half an hour starting at about 4:30 ET.\n\nProof it's me: https://twitter.com/BarackObama/status/240903767350968320\n\nWe're running early and will get started soon.\n\nUPDATE: Hey everybody - this is barack. Just finished a great rally in Charlottesville, and am looking forward to your questions. At the top, I do want to say that our thoughts and prayers are with folks who are dealing with Hurricane Isaac in the Gulf, and to let them know that we are going to be coordinating with state and local officials to make sure that we give families everything they need to recover.\n\nVerification photo: http://i.imgur.com/oz0a7.jpg\n\nLAST UPDATE: I need to get going so I'm back in DC in time for dinner. But I want to thank everybody at reddit for participating - this is an example of how technology and the internet can empower the sorts of conversations that strengthen our democracy over the long run. AND REMEMBER TO VOTE IN NOVEMBER - if you need to know how to register, go to http://gottaregister.com. By the way, if you want to know what I think about this whole reddit experience - NOT BAD!\n\nhttp://www.barackobama.com/reddit\n[edit: link fixed by staff]", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "root_su", "title": "Protect Net Neutrality. Save the Internet.", "score": 201654, "id": "7eojwf", "url": "https://www.battleforthenet.com/", "comms_num": 2721, "timestamp": "2017-11-22T13:33:26+00:00", "body": "", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "korantano", "title": "[AMA Request] Victoria, ex-AMA mod", "score": 126770, "id": "3c0iw2", "url": "https://www.reddit.com/r/IAmA/comments/3c0iw2/ama_request_victoria_exama_mod/", "comms_num": 2803, "timestamp": "2015-07-04T01:36:00+00:00", "body": "**My 6 Questions:**\n\n1. How did you enjoy your time working at Reddit?\n2. Were you expecting to be let go?\n3. What are you planning to do now?\n4. What was your favorite AMA?\n5. Would you come back, if possible?\n6. Are you planning to take [Campus Society's](http://blog.campussociety.com/an-open-letter-to-victoria-previously-of-reddit-become-victoria-of-campus-society/) Job offer?\n\n**Public Contact Information:** @happysquid is her twitter (Thanks /u/crabjuice23 And /u/edjamakated!) & /u/chooter (Thanks /u/alsadius)\n\n\nEdit: The votes dropped from 17K+ to 10K+ in a matter of seconds...what?\n\nEdit again: I've lost a total of about 14K votes...Vote fuzzing seems a bit way too much\n", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "FPGauravLaroia", "title": "FCC just voted to kill Net Neutrality. Now we will SUE THEM and FIGHT in Congress! We are Free Press & friends. AMA", "score": 121804, "id": "7jtes4", "url": "https://www.reddit.com/r/IAmA/comments/7jtes4/fcc_just_voted_to_kill_net_neutrality_now_we_will/", "comms_num": 2618, "timestamp": "2017-12-15T02:12:50+00:00", "body": "The FCC just voted to throw out the Net Neutrality protections. Now cable and phone companies are free to block, slow down, or charge for fast lanes for content on the internet. This vote was a complete disregard for public opinion, facts and the law itself. \n\nFree Press will be suing the FCC and fighting this in Congress in the coming months. I'm a lawyer for Free Press here with our friends & allies and we're happy to answer any of your questions on Net Neutrality. AMA!\n\n[Proof](https://twitter.com/freepress/status/941368736711184384)\n\nWant to help? Here are a few things:\n\n[Visit BattleForTheNet.com to urge Congress to pass a resolution of disapproval](https://www.battleforthenet.com/)\n\n[Join 500K Net Neutrality activists at Team Internet](https://www.battleforthenet.com/jointeaminternet/)\n\n[Donate to Free Press to support our legal fight](https://act.freepress.net/donate/internet_nn_lawsuit/?source=reddit)\n\nSupport our amazing allies:\n \n[Fight for the Future](https://donate.fightforthefuture.org/?utm_source=www&utm_medium=web&utm_campaign=headerlinks)  \n\n[Demand Progress](https://secure.actblue.com/contribute/page/demanding?refcode=homepage&recurring=12)\n\n[Center for Media Justice](http://action.mag-net.org/donation_option)\n\n[18 Million Rising](https://action.18mr.org/donate/)\n\n[National Hispanic Media Coalition](http://www.nhmc.org/donate/)\n\n[Color of Change](https://secure.actblue.com/donate/cocdonation2017)\n\n[Public Knowledge](https://www.publicknowledge.org/give/)\n\n[Open Technology Institute](https://www.newamerica.org/our-funding/donate/)\n", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "StanGibson18", "title": "I’m American citizen, undecided voter, loving husband Ken Bone, Welcome to the Bone Zone! AMA", "score": 116916, "id": "57dw9a", "url": "https://www.reddit.com/r/IAmA/comments/57dw9a/im_american_citizen_undecided_voter_loving/", "comms_num": 16770, "timestamp": "2016-10-14T09:21:33+00:00", "body": "Hello Reddit,\n\nI’m just a normal guy, who spends his free time with his hot wife and cat in St. Louis. I didn’t see any of this coming, it’s been a crazy week. I want to make something good come out of this moment, so I’m donating a portion of the proceeds from my Represent T-Shirt campaign to the St. Patrick Center raising money to fight homelessness in St. Louis.\n\nI’m an open book doing this AMA at my desk at work and excited to answer America’s question.\n\nPlease support the campaign and the fight on homelessness! [Represent.com/bonezone](https://represent.com/bonezone/)\n\nProof: http://i.imgur.com/GdMsMZ9.jpg\n\nEdit: signing off now, just like my whole experience so far this has been overwhelmingly positive!  Special thanks to my Reddit brethren for sticking up for me when the few negative people attack.  Let's just show that we're better than that by not answering hate with hate.  Maybe do this again in a few weeks when the ride is over if you have questions about returning to normal.\n\nMy client will be answering no further questions.\n\nNEW EDIT:  This post is about to be locked, but questions are still coming in.  I made a new AMA to keep this going.  [You can find it here!](https://redd.it/63posi)\n\n", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "thisisbillgates", "title": "I’m Bill Gates, co-chair of the Bill & Melinda Gates Foundation. Ask Me Anything.", "score": 110077, "id": "aunv58", "url": "https://www.reddit.com/r/IAmA/comments/aunv58/im_bill_gates_cochair_of_the_bill_melinda_gates/", "comms_num": 19194, "timestamp": "2019-02-26T01:36:56+00:00", "body": "I’m excited to be back for my seventh AMA. I’ve learned a lot from the Reddit community over the past year (check out this fascinating [thread](https://www.reddit.com/r/robotics/comments/adxzo7/what_areas_of_robotics_research_are_you_most/) on robotics research), and I can’t wait to answer your questions.\n\nIf you’re wondering what I’ve been up to (besides waiting in line for hamburgers), I recently [wrote](https://www.gatesnotes.com/About-Bill-Gates/Year-in-Review-2018?WT.mc_id=02_25_2019_10_AL2019_BG-RE_&WT.tsrc=BGRE) about what I learned at work last year.\n\nMelinda and I also just [published](https://www.gatesnotes.com/2019-Annual-Letter?WT.mc_id=02_25_2019_10_AL2019_BG-RE_&WT.tsrc=BGRE) our 11th Annual Letter. We wrote about nine things that have surprised us and inspired us to take action.\n\nOne of those surprises, for example, is that Africa is the youngest continent. Here is an [infographic](https://www.reddit.com/r/Infographics/comments/aulqu1/africa_is_the_youngest_continent/) I made to explain what I mean.\n\n**Proof:** [https://](https://old.reddit.com/user/thisisbillgates/comments/auo4qn/cant_wait_to_kick_off_my_seventh_ama/)[reddit.com/user/thisisbillgates/comments/auo4qn/cant\\_wait\\_to\\_kick\\_off\\_my\\_seventh\\_ama/](https://old.reddit.com/user/thisisbillgates/comments/auo4qn/cant_wait_to_kick_off_my_seventh_ama/)\n\n**Edit:** I have to sign-off soon, but I’d love to answer a few more questions about energy innovation and climate change. If you post your questions [here](https://www.reddit.com/user/thisisbillgates/comments/auosel/ask_me_about_energy_innovation_and_climate_change/), I’ll answer as many as I can later on.\n\n**Edit:** Although I would love to stay forever, I have to get going. Thank you, Reddit, for another great AMA:  [https://imgur.com/a/kXmRubr](https://imgur.com/a/kXmRubr)", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "thisisbillgates", "title": "I’m Bill Gates, co-chair of the Bill & Melinda Gates Foundation. Ask Me Anything.", "score": 105322, "id": "80ow6w", "url": "https://www.reddit.com/r/IAmA/comments/80ow6w/im_bill_gates_cochair_of_the_bill_melinda_gates/", "comms_num": 19136, "timestamp": "2018-02-28T02:42:04+00:00", "body": "I’m excited to be back for my sixth AMA.\n\n\nHere’s a couple of the [things I won’t be doing today](http://www.reddit.com/user/thisisbillgates/comments/80nbcf/things_i_wont_be_doing_today/) so I can answer your questions instead.\n\n\nMelinda and I just published our 10th Annual Letter. We marked the occasion by answering 10 of the hardest questions people ask us. Check it out here: http://www.gatesletter.com.\n\n\n**Proof:** https://twitter.com/BillGates/status/968561524280197120\n\n**Edit:** You’ve all asked me a lot of tough questions. Now it’s my turn to ask you a question: https://www.reddit.com/r/AskReddit/comments/80phz7/with_all_of_the_negative_headlines_dominating_the/\n\n**Edit:** I’ve got to sign-off. Thank you, Reddit, for another great AMA: https://www.reddit.com/user/thisisbillgates/comments/80pkop/thanks_for_a_great_ama_reddit/\n\n", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "TheRealLeahRemini", "title": "I am Leah Remini, Ask Me Anything about Scientology", "score": 97735, "id": "5fjszg", "url": "https://www.reddit.com/r/IAmA/comments/5fjszg/i_am_leah_remini_ask_me_anything_about_scientology/", "comms_num": 17718, "timestamp": "2016-11-30T01:08:06+00:00", "body": "Hi everyone, I’m Leah Remini, author of Troublemaker : Surviving Hollywood and Scientology. I’m an open book so ask me anything about Scientology. And, if you want more, check out my new show, Leah Remini: Scientology and the Aftermath, tonight at 10/9c on A&E.\n\nProof: https://i.redd.it/ri3zbip14g0y.jpg\n\nMore Proof: https://twitter.com/AETV/status/811043453337411584\n\nhttps://www.facebook.com/AETV/videos/vb.14044019798/10154742815479799/?type=3&theater", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "thisisbillgates", "title": "I’m Bill Gates, co-chair of the Bill & Melinda Gates Foundation. Ask Me Anything.", "score": 97541, "id": "5whpqs", "url": "https://www.reddit.com/r/IAmA/comments/5whpqs/im_bill_gates_cochair_of_the_bill_melinda_gates/", "comms_num": 16412, "timestamp": "2017-02-28T00:36:23+00:00", "body": "I’m excited to be back for my fifth AMA. \n\n\nMelinda and I recently published our latest Annual Letter: http://www.gatesletter.com.\n\n\nThis year it’s addressed to our dear friend Warren Buffett, who donated the bulk of his fortune to our foundation in 2006. In the letter we tell Warren about the impact his amazing gift has had on the world.\n\n\nMy idea for a David Pumpkins sequel at Saturday Night Live didn't make the cut last Christmas, but I thought it deserved a second chance: https://youtu.be/56dRczBgMiA.\n\n\n**Proof:** https://twitter.com/BillGates/status/836260338366459904\n\n\n**Edit:** Great questions so far. Keep them coming: http://imgur.com/ECr4qNv\n\n\n**Edit:** I’ve got to sign off. Thank you Reddit for another great AMA. And thanks especially to: https://youtu.be/3ogdsXEuATs\n\n\n", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "bernie-sanders", "title": "I am Senator Bernie Sanders. Ask Me Anything!", "score": 96475, "id": "9tm9oo", "url": "https://www.reddit.com/r/IAmA/comments/9tm9oo/i_am_senator_bernie_sanders_ask_me_anything/", "comms_num": 15082, "timestamp": "2018-11-03T01:38:17+00:00", "body": "Hi Reddit. I'm Senator Bernie Sanders. I'll start answering questions at 2 p.m. ET. The most important election of our lives is coming up on Tuesday. I've been campaigning around the country for great progressive candidates. Now more than ever, we all have to get involved in the political process and vote. I look forward to answering your questions about the midterm election and what we can do to transform America.\n\nBe sure to make a plan to vote here: [https://iwillvote.com/](https://iwillvote.com/)\n\nVerification: [https://twitter.com/BernieSanders/status/1058419639192051717](https://twitter.com/BernieSanders/status/1058419639192051717)\n\nUpdate: Let me thank all of you for joining us today and asking great questions. My plea is please get out and vote and bring your friends your family members and co-workers to the polls. We are now living under the most dangerous president in the modern history of this country. We have got to end one-party rule in Washington and elect progressive governors and state officials. Let’s revitalize democracy. Let’s have a very large voter turnout on Tuesday. Let’s stand up and fight back.", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "Tyree07", "title": "Joe Manchin refused to listen to our pleas for help. He said, “I’m not changing. Find somebody else who can beat me and vote me out.“ So, I took him up on it. I’m running for US Senate for the beautiful State of West Virginia, and my name is Paula Jean Swearengin. AMA [xpost /r/Political_Revolution]", "score": 94009, "id": "6qwjro", "url": "https://www.reddit.com/r/IAmA/comments/6qwjro/joe_manchin_refused_to_listen_to_our_pleas_for/", "comms_num": 1, "timestamp": "2017-08-01T22:24:49+00:00", "body": "#[Ask questions over here at /r/Political_Revolution!](https://www.reddit.com/r/Political_Revolution/comments/6qwhzl/joe_manchin_refused_to_listen_to_our_pleas_for/)\n\n---\n\n\n#[I’m Paula Jean Swearengin, and I’m running for US Senate in West Virginia.](http://imgur.com/U9Jtsbx)\n\n---\n\nBarely five months ago, I was standing at a town hall where Joe Manchin was supposed to be listening to his constituents in Charleston, West Virginia. I’ve been a social and economic activist for many years, and I heard that he was at this town hall, just minutes after I got off work. I left in such a hurry that I didn’t even have money for the toll -- I had to leave an IOU instead. I was desperate to speak to him because my community had suffered so much, and I held onto the hope that he would hear me. Instead of cooking dinner for my youngest son, yet again, I went on a mission to beg for my children’s future. I wanted them to have clean water, clean air, and a stable economic future. I was especially frustrated because the most-polluting coal baron in West Virginia, Jim Justice, became my Democratic Governor. His mountaintop removal coal-mining operation is just three miles from my house, and continues to put silica dust in the air and my childrens’ lungs daily.\n\n---\n\n###When I approach my Senator, I told him about the water pollution, air pollution, and the fact that I buried most of my family because of coal mining with diseases like black lung and cancer. I told him that we all deserved clean and safe jobs. \n\n---\n\n“We would have to agree to disagree” he told me, as he tried to bid the coal miners in the crowd against me. When I told him about my family dying, he turned to them and said they needed jobs -- as if that was more important than their own safety, and their families and surrounding communities being poisoned and dying.\n\nNot only did he act like he was immune to my struggle as a coal miner’s daughter, he tried to divide and turn our community against one another. We shouldn’t have to fight each other for basic human rights like clean water, clean air and have access to jobs to provide for our families.Little did Joe know that the coal miners in the crowd met and stood with me afterwards, and we talked about real solutions -- not just slogans.\n\nA month earlier, Sen. Manchin taunted voters to kick him out of office if they didn’t like what he was up to. “What you ought to do is vote me out. Vote me out! I’m not changing. Find somebody else who can beat me and vote me out,” he said. So, after my encounter with the Senator, I decided to take him up on his challenge -- I was going to take his seat from him, and return representation to the people of West Virginia.\n\nLike most of my generation I was born a coal miner’s daughter and granddaughter. I have lived most of my life watching the progression and regression of coal. I have witnessed\nfirst-hand the impact it has on our health and communities. I have in lived poverty and in prosperity. I have tasted polluted water. I have enjoyed some of the cleanest water in the world -- that no longer exists. I have dealt with the suffering of burying family members far too soon and too young. I have lived in cancer-clustered communities. I live with the worry that my children will get cancer. I have watched my neighbors suffer on their way to the same fate. I can’t help but feel overwhelmed with the frustration of what will happen to the people of Appalachia.\n\nThe promise of coal means more pollution, more cancer, and more black lung. The companies are still blowing up our mountains, burying our streams, destroying our heritage and devaluing our quality of life. We have no promise of a stable economic future with the market for coal being down. It has always been an unreliable and unstable economic resource. As many communities are forced to live in conditions comparable to a third-world country, people fear how they are going to provide for their families. No man or woman should have to choose between poisoning one child and feeding another.\n\nIt’s past time to end the fear that divides us. We need to start standing up for each other. There are alternatives. We can invest in a diverse economy. I, for one, don’t want my children to\ninherit the struggles that we have had to endure. \n\nI’m proud to be a [Justice Democrat](http://www.justicedemocrats.com?utm_source=reddit&utm_medium=PaulaJean&utm_campaign=AMA0801) and a [Brand New Congress](http://www.brandnewcongress.org?utm_source=reddit&utm_medium=PaulaJean&utm_campaign=AMA0801) candidate. That means I take $0 in corporate donations or PAC money. Zero. I rely on 100% individual small donors. I’ve watched how corporate money can twist even good politicians. I watched it happen to Sen. Manchin. I voted for him, long ago -- but I no longer recognize that man I voted for. It also means I support the [Brand New Congress platform](https://brandnewcongress.org/platform?utm_source=reddit&utm_medium=PaulaJean&utm_campaign=AMA0801), including Medicare for All, free public higher and vocational education, and moving to an expanded economy for West Virginia and America, based on renewable energy.\n\n**Social Media Links**:\n\n[Website](https://brandnewcongress.org/paulajean) | [Facebook](https://www.facebook.com/paulajean2018) | [Twitter](https://twitter.com/paulajean2018)\n\n**Info Links**:\n\n[Ballotpedia](https://ballotpedia.org/Paula_Jean_Swearengin) | [Wikipedia](https://en.wikipedia.org/wiki/Paula_Jean_Swearengin)\n\n**Other Important Links**:\n\n\n* /r/JusticeDemocrats\n* /r/BrandNewCongress\n* /r/Swearengin4Senate\n\n[Donate to my campaign.](https://secure.actblue.com/donate/paulajean2018?refcode=0801_reddit_ama&amount=27.00) | [Sign up to volunteer.](https://now.brandnewcongress.org/act?utm_source=reddit&utm_medium=PaulaJean&utm_campaign=AMA0801) | [Platform](https://brandnewcongress.org/platform?utm_source=reddit&utm_medium=PaulaJean&utm_campaign=AMA0801)", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "WKRG_AlanSealls", "title": "I'm Alan Sealls, your friendly neighborhood meteorologist who woke up one day to Reddit calling me the \"Best weatherman ever\" AMA.", "score": 92916, "id": "6zoy5o", "url": "https://www.reddit.com/r/IAmA/comments/6zoy5o/im_alan_sealls_your_friendly_neighborhood/", "comms_num": 4120, "timestamp": "2017-09-13T02:41:56+00:00", "body": "Hello Reddit! \n\nI'm Alan Sealls, the longtime Chief Meteorologist at WKRG-TV in Mobile, Alabama who woke up one day and was being called the \"Best Weatherman Ever\" by so many of you on Reddit. \n\nHow bizarre this all has been, but also so rewarding!  I went from educating folks in our viewing area to now talking about weather with millions across the internet.  Did I mention this has been bizarre?\n\nA few links to share here:\n\nPlease help us help the victims of this year's hurricane season: https://www.redcross.org/donate/cm/nexstar-pub\n\nAnd you can find my forecasts and weather videos on my Facebook Page: https://www.facebook.com/WKRG.Alan.Sealls/\n\n[Here is my proof](https://twitter.com/WKRG/status/906301177154949120)\n\nAnd lastly, thanks to the /u/WashingtonPost for the help arranging this! \n \nAlright, quick before another hurricane pops up, ask me anything!\n\n[EDIT: We are talking about this Reddit AMA right now on WKRG Facebook Live too! https://www.facebook.com/WKRG.News.5/videos/10155738783297500/]\n\n[EDIT #2 (3:51 pm Central time): THANKS everyone for the great questions and discussion. I've got to get back to my TV duties. Enjoy the weather!]", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "fallenangel3633", "title": "I am a 100 year old human and a World War 2 veteran. I want to share my life and experiences with people who might be helped by them. Ask me anything!", "score": 91801, "id": "drk4qc", "url": "https://www.reddit.com/r/IAmA/comments/drk4qc/i_am_a_100_year_old_human_and_a_world_war_2/", "comms_num": 5022, "timestamp": "2019-11-05T00:37:23+00:00", "body": "Greetings!\n\nAs you may have imagined, the person typing and facilitating this AMA is not the 100 year old human, but his granddaughter, me!\n\nA little bit about my grandpa: he grew up in Washington State, and has traveled quite a bit. He worked for the FDA for many years, some as an investigator, some as a pharmacist. He served in the air force during World War 2 as a photographer.\n\nClearly there's more to him than this, so ask him some questions!\n\nProof: [https://imgur.com/pFBHcWZ](https://imgur.com/pFBHcWZ)\n\n&#x200B;\n\nY'all he is enjoying this so much! He's flabbergasted at how many people are asking questions and upvoting him, at first he thought it was all people I knew haha. He's so happy! We're gonna take a little break, some of my family just arrived for a visit.\n\n4:14 PM ET: we're back! gonna knock out some more questions until I have to dip. Appreciate all the interest! Sorry he sometimes misunderstands some questions aha.\n\nWith a lot of these I'll ask him and he says 'let me think about that a bit' and I'll circle back and I guess he hasn't finished thinking about them - so sorry for those still waiting! lol\n\n5:05 PM ET: So he's starting to fall asleep as I ask him questions, so I think we're gonna call it a day aha. He's in rehab for a broken hip right now, and a bit forgetful and confused at times, so hopefully that will give some explanation to some of the stranger answers he's said. Thank you so much for everyone who asked things and commented and told stories and thanked him, he is just so pleased!!! I'll go through this as I'm able and answer what I can from my perspective. Next time I visit him, I'll try to get a few more answered. He'll remember this for a long time. Thank you all, SO MUCH!!!\n\n11/6/19 5:39 PM ET: Hi all! I stopped by my grandpa's current place today and asked and answered a few more questions! He gets tired pretty quickly, and tends to say \"I need to think about that\" for things that aren't direct (broad questions like \"meaning of life\" and such), so for further questions I would encourage more specific questions. I'll continue asking him things as we're able - there are a lot to go through, but I and we appreciate the interest so much - every time I update him about the number of upvotes, his face lights up :)\n\n&#x200B;\n\nSome people have been requesting pictures, so here they are:  [https://imgur.com/a/0yz41Nq](https://imgur.com/a/0yz41Nq) \n\n&#x200B;\n\nWhile we're here and this has so much visibility (wow), I've gotta put this out there, cause I'd really love to have the opportunity to live as long as my grandpa has: WE NEED CLIMATE ACTION!!! We are currently headed down a very dangerous path, due to the fault of the super-wealthy who have gotten rich off of fossil fuels and extractive industries and covered up the negative consequences that will have a disproportionate harmful effect on poor people both in the future and now (BOOOO). While the situation is dire, THERE IS HOPE!!! But only if we come together and take an ACTIVE role in politics - local, state, and national - pushing for climate solutions! The easiest way to do this is, of course, to get good people into office who will push for climate justice so we don't have to be in the streets all the time, so vote responsibly - make sure that human isn't just greenwashing while still taking money from fossil fuel industry, but is taking REAL action (coughBERNIEandAOCareGREATcough)! And, if you are able, please please PLEASE join a climate justice organization, or donate to one - it has given me a great sense of community and solace being in the Sunrise Movement, being around people who are scared about the future just like me and learning about what to do about it together - it's been a truly transformative influence in my life, and I am so thankful for that. Links below for some organizations I like (but there are definitely others, so please, look them up and find one right for you!) (note: while my grandpa is not super hip about all the aspects of climate change, I have shared my life with him and he has been super supportive of me in my journey of action, and for that I am so grateful) JOIN, TAKE ACTION, SUPPORT THE GREEN NEW DEAL, AND/OR DONATE PLEASE, I WANT US ALL TO LIVE AS LONG AS MY GRANDPA <3\n\n[https://www.sunrisemovement.org/](https://www.sunrisemovement.org/)\n\n[https://rebellion.earth/](https://rebellion.earth/)\n\nthicc list:  [https://www.usclimatenetwork.org/member-organizations](https://www.usclimatenetwork.org/member-organizations)", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "wamandajd", "title": "I'm the Monopoly Man that trolled Equifax -- AMA!", "score": 80420, "id": "74nyxw", "url": "https://www.reddit.com/r/IAmA/comments/74nyxw/im_the_monopoly_man_that_trolled_equifax_ama/", "comms_num": 5744, "timestamp": "2017-10-06T22:31:09+00:00", "body": "I am a lawyer, activist, and professional troublemaker that photobombed former Equifax CEO Richard Smith in his Senate Banking hearing (https://twitter.com/wamandajd). I \"cause-played\" as the Monopoly Man to call attention to S.J. Res. 47, Senate Republicans' get-out-of-jail-free card for companies like Equifax and Wells Fargo - and to brighten your day by trolling millionaire CEOs on live TV. Ask me anything!\n\nProof:\n\n - https://i.redd.it/6cmuac6dv1qz.jpg\n - https://i.redd.it/kji1krugv1qz.jpg\n\nTo help defeat S.J. Res. 47, sign our petition at www.noripoffclause.com and call your Senators (tool & script here: http://p2a.co/m2ePGlS)!\n\nETA: Thank you for the great questions, everyone! After a full four hours, I have to tap out. But feel free to follow me on Twitter at @wamandajd if you'd like to remain involved and join a growing movement of creative activism.", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "_EdwardSnowden", "title": "We are Edward Snowden, Laura Poitras and Glenn Greenwald from the Oscar-winning documentary CITIZENFOUR. AUAA.", "score": 79183, "id": "2wwdep", "url": "https://www.reddit.com/r/IAmA/comments/2wwdep/we_are_edward_snowden_laura_poitras_and_glenn/", "comms_num": 10678, "timestamp": "2015-02-24T03:03:30+00:00", "body": "Hello reddit!\n\nLaura Poitras and Glenn Greenwald here together in Los Angeles, joined by Edward Snowden from Moscow.\n\nA little bit of context: Laura is a filmmaker and journalist and the\ndirector of CITIZENFOUR, which last night won the Academy Award for Best Documentary Feature.\n\nThe film debuts on HBO tonight at 9PM ET| PT\n(http://www.hbo.com/documentaries/citizenfour).\n\nGlenn is a journalist who co-founded The Intercept (https://firstlook.org/theintercept/) with Laura and fellow journalist\nJeremy Scahill.\n\nLaura, Glenn, and Ed are also all on the board of directors at Freedom of the Press Foundation. (https://freedom.press/)\n\nWe will do our best to answer as many of your questions as possible, but appreciate your understanding as we may not get to everyone.\n\nProof: http://imgur.com/UF9AO8F\n\n**UPDATE**: I will be also answering from /u/SuddenlySnowden.\n\nhttps://twitter.com/ggreenwald/status/569936015609110528\n\n**UPDATE**: I'm out of time, everybody. Thank you so much for the interest, the support, and most of all, the great questions. I really enjoyed the opportunity to engage with reddit again -- it really has been too long.", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "-Futurama_Official-", "title": "Good news, Redditors! We are Matt Groening, David X. Cohen, Billy West, and John Dimaggio, here to talk all things FUTURAMA! Ask away, meatbags!", "score": 79077, "id": "6ka4pd", "url": "https://www.reddit.com/r/IAmA/comments/6ka4pd/good_news_redditors_we_are_matt_groening_david_x/", "comms_num": 8782, "timestamp": "2017-06-30T02:04:14+00:00", "body": "Hello Reddit! We’ve returned to the 21st Century to answer all your puny human questions about FUTURAMA.\n\nWe are Matt Groening (series creator), David X. Cohen (head writer), Billy West (voice of Fry, Professor Farnsworth, Dr. Zoidberg, and more), and John DiMaggio (voice of Bender, URL, and more).\n\nMatt Groening Proof: http://imgur.com/v6N5dSZ\nBilly West David X Cohen and John DiMaggio proof: http://imgur.com/a/OLqUl\n\nAlso - Our shiny new mobile game, \"Futurama: Worlds of Tomorrow”, launched today... and it's fun on a bun, baby!  Get it here: \niOS: https://appstore.com/futuramaworldsoftomorrow\nAndroid: https://play.google.com/store/apps/details?id=com.tinyco.futurama\n\nWe'll be answering questions here for a little over an hour, then right after our AMA ends we're also doing a livestreamed video QA on Facebook...so talk to us there too! Check that one out on the Futurama Facebook page: https://www.facebook.com/Futurama/ from 2:30-3:30PM PST\n\nEDIT: Thank you all so much for your questions. We've gotta run! A few of us might pop back in now and then to answer some more of your questions. Check us out at 2:30PM Pacific Time this afternoon for more live streamed Q&A on the Futurama Facebook page - you can ask us even more questions! ", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "bernie-sanders", "title": "I am Senator Bernie Sanders, Democratic candidate for President of the United States — AMA", "score": 77664, "id": "36j690", "url": "https://www.reddit.com/r/IAmA/comments/36j690/i_am_senator_bernie_sanders_democratic_candidate/", "comms_num": 12317, "timestamp": "2015-05-20T03:50:19+00:00", "body": "Hi Reddit. I'm Senator Bernie Sanders. I'll start answering questions at 4 p.m. ET. **[Please join our campaign for president at BernieSanders.com/Reddit.](http://berniesanders.com/reddit)**\n\nBefore we begin, let me also thank the grassroots Reddit organizers over at /r/SandersforPresident for all of their support. Great work.\n\nVerification: https://twitter.com/BernieSanders/status/600750773723496448\n\nUpdate: Thank you all very much for your questions. I look forward to continuing this dialogue with you.", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "Me_CookieMonster", "title": "Me COOKIE MONSTER. Me want you to come visit me on Sesame Street! Me will bring da COOKIES! AMA.", "score": 75511, "id": "anu4u9", "url": "https://www.reddit.com/r/IAmA/comments/anu4u9/me_cookie_monster_me_want_you_to_come_visit_me_on/", "comms_num": 5037, "timestamp": "2019-02-07T03:00:48+00:00", "body": "HI! Me COOKIE MONSTER. Me love cookies. And me want to meet you!\n\nMe running dis thing where you and a friend can come to Sesame Street to eat Cookies with Oscar the Grouch. No no, me just joking! You get to eat cookies with ME! And me promise, me will share! Just go to [**DIS LINK**](http://omaze.com/experiences/cookie-monster-sesame-street?ref=reddit) to enter!\n\nAnd da best part? All of money we collect will go to help the [Yellow Feather Fund](http://yellowfeatherfund.org/). Like me friend Chris say, it help us bring learning and laughter to children in need. Ya, ya, ya get to do good *and* eat cookies! It what we call “win win.”\n\nOkay, me be back in 20 minutes or so to answer your questions. (Me have to take a batch of cookies out of da oven! Oh boy oh boy oh boy, me can't wait!) See you soon!\n\nDa proof:\n\n[https://twitter.com/MeCookieMonster/status/1093223503258636290](https://twitter.com/MeCookieMonster/status/1093223503258636290)\n\n***\n\n\n**[DAT WAS FUN! Thank you for da questions and da COOKIES!](https://twitter.com/MeCookieMonster/status/1093268164526379009)**\n\n", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "_Gordon_Ramsay", "title": "I am Gordon Ramsay. AMA.", "score": 72605, "id": "334wcy", "url": "https://www.reddit.com/r/IAmA/comments/334wcy/i_am_gordon_ramsay_ama/", "comms_num": 10878, "timestamp": "2015-04-20T00:05:19+00:00", "body": "Hello reddit.\n\nGordon Ramsay here. This is my first time doing a reddit AMA, and I'm looking forward to answering as many of your questions as time permits this morning (with assistance from Victoria from reddit).\n\nThis week we are celebrating a milestone, I'm taping my 500th episode (#ramsay500) for FOX prime time!\n\nAbout me: I'm an award-winning chef and restaurateur with 25 restaurants worldwide (http://www.gordonramsay.com/). Also known for presenting television programs, including Hell's Kitchen, MasterChef, MasterChef Junior, Hotel Hell and Kitchen Nightmares.\n\nAMA!\n\nhttps://twitter.com/GordonRamsay/status/589821967982669824\n\n**Update** First of all, I'd like to say thank you.\n\nAnd never trust a fat chef, because they've eaten all the good bits. \n\nAnd I've really enjoyed myself, it's been a fucking blast. And I *promise* you, I won't wait as long to do this again next time. Because it's fucking great! ", "subscribers": 20894512, "subreddit": "IAmA"}, {"author": "fearless1927", "title": "I am a 92 year old German born Jew who grew up in the Hitler youth and was forced to fight in WW2 in the German anti-tank division. I deserted and became a POW in a British camp and eventually moved to Canada in 1955. Just recently, I published a memoir of my life. AMA", "score": 72544, "id": "ej5wwp", "url": "https://www.reddit.com/r/IAmA/comments/ej5wwp/i_am_a_92_year_old_german_born_jew_who_grew_up_in/", "comms_num": 3789, "timestamp": "2020-01-03T06:59:51+00:00", "body": "I was born in 1927 in Herne, Germany. To quote from my memoir, \"I am a survivor of Nazi Germany during WW2. During my childhood I had to live 2 lives: a false public one as a loyal Nazi and my true one at home as a Jewish child in an anti-fascist family.\" Though both of my legal parents were German citizens, by biological father was Jewish. My family was always very open and accepting of others, and did not support fascism (but did what they needed to to survive). During WW2, we kept my heritage a secret. As a result, I was raised in the Hitler youth and trained as an anti-aircraft soldier. I was quite tall and desirable to the SS, but I had no interest in becoming one of them, so I volunteered to be in the anti-tank division once I was old enough to enlist.\n\nThough I fought as a German, I never believed in the war and waited for an opportunity to desert. When I was 17 a group of like-minded soldiers and I deserted and became POW in a British camp for 7 months.\n\nWhen the war ended, I returned to the secret family business of smuggling. The economic depression post-WW2 created an opportunity for my family to make money by illegally importing goods from surrounding countries (e.g. women's stockings from France). During this time I married my wife and had my first daughter.\n\nIn 1955, my wife, daughter, and I moved to Montreal, Canada. I worked any job I could get, including work as a butcher (even though I was not trained as one), a gas station attendant, and a candy maker. In 1958 we moved to Thunder Bay where I worked in a factory, then as a logger. There I had 3 more children.\n\nMy family and I eventually moved to Thompson, Manitoba so I could work in the mine. We had a good standard of living there (my wife was quite happy). We had a brand new home and plenty of extra income, but I saw no future for my children there. I lied to my wife, saying I had secured a job at the Britannia Beach mine and moved the entire family across Canada to Squamish, BC. I did end up getting a job in the mine, where I worked for a few months (until they went on strike). After that I worked in a pulp and paper mill (Woodfibre) for 25 years until my retirement.\n\nMy wife passed away from cancer in 2001. Since then I have traveled extensively, remarried, and am living happily in BC. I recently wrote a book about my life and you can find it here: [https://www.amazon.ca/FEARLESS-Jewish-boy-Nazi-Germany/dp/1674561202/ref=sr\\_1\\_4?keywords=fearless&qid=1578004297&sr=8-4](https://www.amazon.ca/FEARLESS-Jewish-boy-Nazi-Germany/dp/1674561202/ref=sr_1_4?keywords=fearless&qid=1578004297&sr=8-4)\n\nUSA link here :  [https://www.amazon.com/FEARLESS-Jewish-boy-Nazi-Germany/dp/1674561202/ref=sr\\_1\\_6?keywords=middelmann&qid=1578093209&sr=8-6](https://www.amazon.com/FEARLESS-Jewish-boy-Nazi-Germany/dp/1674561202/ref=sr_1_6?keywords=middelmann&qid=1578093209&sr=8-6)\n\nHello Reddit, I am Roberts grand-daughter. I will be helping him with this post, by asking him your questions and writing his responses. He would like to add that this post makes it sound like his life was a lot more smooth and pre-planned than it was. His life was a lot more 'by the seat of his pants' than this suggests.\n\nBelow we have attached some photos from his life\n\n[https://imgur.com/6HHns4T](https://imgur.com/6HHns4T)\n\n[https://imgur.com/YXmbbvv](https://imgur.com/YXmbbvv)\n\n[https://imgur.com/r8CXl4g](https://imgur.com/r8CXl4g)\n\n[https://imgur.com/M293MDR](https://imgur.com/M293MDR)\n\n[https://imgur.com/33gdQDW](https://imgur.com/33gdQDW)\n\n[https://imgur.com/xKS6AoK](https://imgur.com/xKS6AoK)\n\n[https://imgur.com/NOhWVL6](https://imgur.com/NOhWVL6)\n\n[https://imgur.com/8lR9RkT](https://imgur.com/8lR9RkT)\n\nNSFW [https://imgur.com/t0VDnVX](https://imgur.com/t0VDnVX)\n\n&#x200B;\n\n\\*\\*\\* EDIT 1\\*\\*\\*\n\nHello everyone, thanks for the overwhelming amount of responses. We are going to stop answering questions for now but we might try and answer some of the bigger ones in the next couple days, when I (grand-daughter) am able to get together with Robert again.\n\nAlso, to people wondering how someone who had a Jewish father, who was killed for being a Jew, could be alive (since the Germans would have killed the whole family). Simply put, Robert's biological father and legal father are two different people. His biological father was one of his neighbors and worked as a sales manager for the family.  Robert found out at 4 years old, but he was still raised to be his legal father's son.\n\n\\*\\*\\*EDIT 2\\*\\*\\*\n\nRobert has asked me (granddaughter) to add his reflections on all the comments he has either read or responded to:\n\nI’d like to thank everyone for their questions and comments, even the ones who insulted me. I am able to understand them. Most of your questions are answered in my memoir, “FEARLESS” “A Jewish boy in Nazi Germany.” I would like to clarify a few things for those who have read my profile. My family was totally opposed to Hitler and the Nazi regime. During the war we risked our lives to help those who were being persecuted by the Nazis. After the war I reconnected with some holocaust survivors who I had helped and were my friends. In 1944 Hitler was losing the war and students were forced to join in the fight. Our entire grade 10 class of 15 and 16-year-old students were placed in the anti-aircraft units. Soon I was made to join the tank division and after my training I was being sent on a suicide mission to blow up allied tanks. In order to avoid this I smashed my foot with a 100 pound boulder. I wanted the allies to win as I saw them as our liberators from an evil and brutal regime. I am very thankful that I escaped armed combat and never killed anyone during the war. It has been estimated that 150,000 Jews or partial Jews served in Hitler’s military. I was one of them.", "subscribers": 20894512, "subreddit": "IAmA"}]