[{"author": "w2555", "title": "LPT: keep your mouth shut, and don't volunteer information", "score": 165156, "id": "f6jt5e", "url": "https://www.reddit.com/r/LifeProTips/comments/f6jt5e/lpt_keep_your_mouth_shut_and_dont_volunteer/", "comms_num": 4922, "timestamp": "2020-02-20T07:48:09+00:00", "body": "I had a phone interview scheduled this morning, but accidentally slept through it. When I got up and saw that I missed it, I had the desperate urge to call and offer up excuses, in the hope that maybe, just maybe, they'd be understanding and give me another chance. \n\nInstead, all I did was apologize and ask if we could reschedule. That's it, one sentence, no additional information, no explanation or excuse as to why I missed the first interview. \n\nThey replied within 20 minutes, apologizing to ME, saying it was probably their fault, that they'd been having trouble with their computer system for days, and of course I could reschedule, was I available that afternoon?\n\nDon't ever volunteer information, kids. You never know what information the other party has, and you can always give information if asked for it later.\n\n\nEdit: I still get notifications when people comment.\nKeep them coming, I'm glad I've helped you out :)", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "this1tyme", "title": "LPT: Texans, you are about to experience the worst potholes many of you have ever seen. Make sure your tire pressure is correct for your vehicles, drive slowly, give plenty of distance between your vehicle and the one in front of you, and don't trust puddles. Love from Michigan.", "score": 132881, "id": "lq1jn7", "url": "https://www.reddit.com/r/LifeProTips/comments/lq1jn7/lpt_texans_you_are_about_to_experience_the_worst/", "comms_num": 4115, "timestamp": "2021-02-23T06:13:26+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "Moonripple616", "title": "LPT: If you want a smarter kid, teach your child to read as early as possible and instill in them a love for books. Because as soon as they can read, they can teach themselves. And that will be a life-long advantage over their peers who don't have that same ability.", "score": 132545, "id": "fpfwra", "url": "https://www.reddit.com/r/LifeProTips/comments/fpfwra/lpt_if_you_want_a_smarter_kid_teach_your_child_to/", "comms_num": 3092, "timestamp": "2020-03-27T01:42:08+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "raviji22", "title": "LPT: When you sign up for anything online, put the website’s name as your middle name. That way when you receive spam/advert emails, you will know who sold your info.", "score": 129101, "id": "j2mm1b", "url": "https://www.reddit.com/r/LifeProTips/comments/j2mm1b/lpt_when_you_sign_up_for_anything_online_put_the/", "comms_num": 1981, "timestamp": "2020-09-30T21:58:38+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "mashingLumpkins", "title": "LPT: Always tell a child who is wearing a helmet how cool you think their helmet is. It will encourage them to always wear it in the future.", "score": 115544, "id": "kzkotx", "url": "https://www.reddit.com/r/LifeProTips/comments/kzkotx/lpt_always_tell_a_child_who_is_wearing_a_helmet/", "comms_num": 1794, "timestamp": "2021-01-18T10:09:18+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "ninnymugginsss", "title": "LPT: Just because you did something wrong in the past, doesn’t mean you can’t advocate against it now. It doesn’t make you a hypocrite. You grew. Don’t let people use your past to invalidate your current mindset. Growth is a concept. Embrace it.", "score": 110524, "id": "gfcq4g", "url": "https://www.reddit.com/r/LifeProTips/comments/gfcq4g/lpt_just_because_you_did_something_wrong_in_the/", "comms_num": 2040, "timestamp": "2020-05-08T02:56:51+00:00", "body": "I just found this quote online and wanted to share it with you guys. Sorry if it’s not the right sub, please let me know. \n\nWhen I read this it really spoke to me. I’ve made mistakes in the past but I’ve also learned from them and I’m a better person because of it. \n\nEveryone makes mistakes and the only thing to do is deal with them and learn from it. Don’t let anyone hold your past wrongdoings against you in order to belittle or invalidate the person you are now.\n\n\nEdit: Can I just say this post is not directed at American politics. I’m not from America nor do I know much about your politics. I’ve not heard of the name Biden until today, sorry! \n\nAlso, thank you to everyone for the upvotes and rewards, I really didn’t expect this post to gain much attention! To the people who are saying they needed to hear this today, I’m so glad it has uplifted you even a little!", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "CalJackBuddy", "title": "LPT: Your company didn’t know you existed before you applied and won’t notice you when you’re gone. Take care of yourself.", "score": 110131, "id": "lkt2w8", "url": "https://www.reddit.com/r/LifeProTips/comments/lkt2w8/lpt_your_company_didnt_know_you_existed_before/", "comms_num": 2545, "timestamp": "2021-02-16T10:02:07+00:00", "body": "That’s it.", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "WellThatsPrompting", "title": "LPT: Anytime you think about contacting an ex or old crush, rub one out first", "score": 109766, "id": "hqmot1", "url": "https://www.reddit.com/r/LifeProTips/comments/hqmot1/lpt_anytime_you_think_about_contacting_an_ex_or/", "comms_num": 2911, "timestamp": "2020-07-14T04:07:15+00:00", "body": "The post nut clarity is real, without the humiliation of getting said clarity after doing something you may regret the rest of your life", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "TanneriteAlright", "title": "LPT: Do not try to be the man your father would want you to be. Be the man you would like your son to be be. It more clearly defines your own convictions, desires, goals, and motivates you to be your best.", "score": 104807, "id": "ktqx4j", "url": "https://www.reddit.com/r/LifeProTips/comments/ktqx4j/lpt_do_not_try_to_be_the_man_your_father_would/", "comms_num": 1433, "timestamp": "2021-01-09T21:29:13+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "socratit", "title": "LPT: if a friend or a family member gets diagnosed with dementia or alzheimer, in the early stages try to find out what their favorite songs of all time are. In this way you would be able to create a playlist for them that could be of great benefit in the later stages of the disease.", "score": 103453, "id": "d09tq7", "url": "https://www.reddit.com/r/LifeProTips/comments/d09tq7/lpt_if_a_friend_or_a_family_member_gets_diagnosed/", "comms_num": 1007, "timestamp": "2019-09-06T09:21:11+00:00", "body": "Music helps dementia patient recall memories and emotions. Especially when specific songs are connected to previous parts of their lives.", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "phedre", "title": "LPT: if your LPT is about fucking coconuts, it will be removed and you will be banned.", "score": 103351, "id": "6s7ln1", "url": "https://www.reddit.com/r/LifeProTips/comments/6s7ln1/lpt_if_your_lpt_is_about_fucking_coconuts_it_will/", "comms_num": 3451, "timestamp": "2017-08-08T02:40:23+00:00", "body": "http://i.imgur.com/GOCpO4I.jpg", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "None", "title": "LPT: don't use your child's embarrassing stories as dinner party talk. They are your child's personal memories and humiliating them for a laugh isn't cool.", "score": 102945, "id": "hin36n", "url": "https://www.reddit.com/r/LifeProTips/comments/hin36n/lpt_dont_use_your_childs_embarrassing_stories_as/", "comms_num": 2817, "timestamp": "2020-06-30T21:12:20+00:00", "body": "I've probably listened to my mum tell one particularly cringe worthy story dozens of times and I think everyone she knows has been told it. Every time she tells it, most of the time in front of me, I just want to crawl under the table and hide. However, that would give her another humiliating story to tell.\n\nJust because you're a parent doesn't mean you have a right to humiliate them for a laugh.\n\nI do think that telling about something cute they once did (pronouncing something wrong, for example) is different to an embarrassing story, but if your child doesn't like you telling about it then you should still find something else to talk about.\n\nEdit: I mean telling stories from any part of your child's life at any part of your child's life. When I say child, I don't mean only someone under 18, I mean the person that is your child.\n\nEdit again: This post blew up, can't believe how big it has gotten. Getting a lot of comments from the children (including adult children) involved but also parents which is awesome.\n\nIm also getting a lot of comments about how this is a self-selecting sample and in the wider world, not as many people would support this. All I have to say is that just because there is another 50,000 people out there (or whatever number) who wouldn't care about this doesn't mean that the 50,000 here matter any less. It's not about proportion, its about that number existing in the first place. How do you know if the person you are talking about isn't one of those 50,000 people?\n\nThere is a much, much more constructive way to teach your child to be less sensitive. I laugh with my kid, not at him. We do it when we're on our own or in safe groups. If he tells me something funny he did, I laugh with him and I'll tell him stupid things I do so we can laugh together.\n\nI don't humiliate him with personal and embarrassing stories around Christmas dinner or whatever. It's about building people up, not breaking them down. Embarrassing someone to give them thicker skin is a massive gamble between ended up with someone being able to laugh at themself and someone who is insecure, or at worst fuels the fire of an anxiety disorder. I'm not gambling with my kid.", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "co1one1huntergathers", "title": "LPT: Gym closed and won't respond to your emails asking to suspended your gym membership? Call the bank and order a 1 year stop payment to them, most banks are currently waiving the fee for this. Also, fuck Anytime Fitness.", "score": 102846, "id": "fu8e1y", "url": "https://www.reddit.com/r/LifeProTips/comments/fu8e1y/lpt_gym_closed_and_wont_respond_to_your_emails/", "comms_num": 2600, "timestamp": "2020-04-03T21:26:22+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "dykejoon", "title": "LPT: When a friend is upset, ask them one simple question before saying anything else: 'Do you want to talk about it or do you want to be distracted from it?'", "score": 101346, "id": "h9fucs", "url": "https://www.reddit.com/r/LifeProTips/comments/h9fucs/lpt_when_a_friend_is_upset_ask_them_one_simple/", "comms_num": 904, "timestamp": "2020-06-15T20:57:49+00:00", "body": "This is honestly one of the best things you can do for an upset friend. I use it all the time and people respond very well to it. Sometimes people come to you because they need to vent. Comfort them first, then follow up with 'do you want advice or do you want me to just listen?'. But other times, they just need to let someone outside of the conflict know what happened, and then they want to talk about something else. Talk about your own day, show them the latest funny thing you saw, go do something fun together. This question sets boundaries and builds trust. It shows you can be there in any way they need.\n\nedit: WOW! so many awards! thanks so much. im going about pming everyone to thank them. but heres a carrd link to BLM resources and a bunch of campaigns, charities, and black owned businesses you can donate to. it would mean so much to me as an ally of the BLM movement if you put a few dollars towards a campaign of your choice. sorry, im on mobile: https://blacklivesmatters.carrd.co/", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "fredsterchester", "title": "LPT: in college it is much better to be friends with the people who have the party house than it is to live at the party house.", "score": 101296, "id": "k4stku", "url": "https://www.reddit.com/r/LifeProTips/comments/k4stku/lpt_in_college_it_is_much_better_to_be_friends/", "comms_num": 2905, "timestamp": "2020-12-02T04:03:39+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "jade_monkey07", "title": "LPT: If you like one song by an artist, but don't dig the rest of their stuff. find out who the producer is and see what other work they've done. The producer can play a big role in how the final song turns out.", "score": 99968, "id": "89unew", "url": "https://www.reddit.com/r/LifeProTips/comments/89unew/lpt_if_you_like_one_song_by_an_artist_but_dont/", "comms_num": 2840, "timestamp": "2018-04-05T07:20:48+00:00", "body": "Edit 1:Woo, front page! All from a stoner moment while listening to black keys - weight of love. \nLove you all!\n\nEdit 2: Obviously this isn't meant to be a blanket statement or a diss towards black keys. Just a way to maybe find some new music. \nAlso look into the song writers, or anybody else that was involved with that specific track. ", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "ProfessorLiftoff", "title": "LPT: Pay Attention to the smell of your home when you come back from a trip - that's what it smells like to guests all the time, you just get used to it.", "score": 97902, "id": "7fnpgs", "url": "https://www.reddit.com/r/LifeProTips/comments/7fnpgs/lpt_pay_attention_to_the_smell_of_your_home_when/", "comms_num": 3153, "timestamp": "2017-11-26T23:59:21+00:00", "body": "Whoa! Front page! And all because I stumbled back in my house, half-asleep and jet lagged from Vegas and noticed my house really smells like my dog. I have so many people to thank! And so many dogs to thank! Like mine, for example. \n\nEdit: Thanks for the gold! And to the rest of you, uh, go Bears and Trubisky is the future. ", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "None", "title": "LPT If you ever forget your WiFi password or you want to get your school WiFi password etc. Just type this command into the command line of a computer already connected to that WiFi: netsh wlan show profile WiFi-name key=clear", "score": 97679, "id": "d5vknk", "url": "https://www.reddit.com/r/LifeProTips/comments/d5vknk/lpt_if_you_ever_forget_your_wifi_password_or_you/", "comms_num": 2880, "timestamp": "2019-09-18T18:07:19+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "muffin_fiend", "title": "LPT: installing a lift-kit? For the love of god, adjust the headlights. Your lifted truck no longer has low-beams; it’s now either high beams or higher beams and you are blinding everyone.", "score": 96630, "id": "kenkm7", "url": "https://www.reddit.com/r/LifeProTips/comments/kenkm7/lpt_installing_a_liftkit_for_the_love_of_god/", "comms_num": 3517, "timestamp": "2020-12-17T09:54:46+00:00", "body": "", "subscribers": 19216228, "subreddit": "LifeProTips"}, {"author": "chaithzluci", "title": "LPT: After a bad break up, do 10 things that your ex would never do with you. You'll feel better and realize how much of yourself was being held back.", "score": 96530, "id": "lcmwqn", "url": "https://www.reddit.com/r/LifeProTips/comments/lcmwqn/lpt_after_a_bad_break_up_do_10_things_that_your/", "comms_num": 3579, "timestamp": "2021-02-05T02:53:18+00:00", "body": "I think this needs to be reminded.", "subscribers": 19216228, "subreddit": "LifeProTips"}]